{
  "memes": [
    "// TODO: Fix this later\n// Narrator: They never fixed it.",
    "It works on my machine ¯\\_(ツ)_/¯",
    "99 little bugs in the code, 99 little bugs, take one down patch it around, 127 little bugs in the code.",
    "\"It's not a bug, it's a feature\" - Every developer ever",
    "Debugging: Being the detective in a crime movie where you are also the murderer.",
    "Code never lies, comments sometimes do.",
    "There are only two hard things in Computer Science: cache invalidation and naming things.",
    "\"Works on my machine\" is the developer's version of \"not my problem\"",
    "Programming is 10% writing code and 90% figuring out why it doesn't work.",
    "I don't always test my code, but when I do, I do it in production.",
    "Real programmers count from 0.",
    "Roses are red, Violets are blue, Unexpected '{' on line 32.",
    "Copy-paste from Stack Overflow: The true developer workflow.",
    "\"I'll just quickly fix this bug\" - Famous last words",
    "Programmer (noun): A machine that turns coffee into code.",
    "If at first you don't succeed, call it version 1.0",
    "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
    "\"This will only take 5 minutes\" - 3 hours later...",
    "Weeks of coding can save you hours of planning.",
    "I'm not lazy, I'm just on energy-saving mode.",
    "My code doesn't have bugs, it just develops random features.",
    "Ctrl+Z: The developer's time machine",
    "I speak fluent sarcasm and broken code.",
    "Error 404: Motivation not found",
    "I'm not procrastinating, I'm doing side quests.",
    "Sleep is for people who don't have a deadline tomorrow.",
    "I don't need Google, my wife/husband knows everything. I don't need my wife/husband, Google knows everything. I don't need Google, I have Stack Overflow.",
    "\"Just one more commit before bed\" - Lies we tell ourselves",
    "The code is more what you'd call 'guidelines' than actual rules.",
    "I have a joke about UDP, but you might not get it.",
    "Semicolons are just emotional support for compilers.",
    "My code is self-documenting. Translation: I have no idea what it does anymore.",
    "Git commit -m \"fixed stuff\" - The most honest commit message.",
    "I'm not arguing, I'm just explaining why my code is right.",
    "Tabs vs Spaces: The only war that matters.",
    "I would love to change the world, but they won't give me the source code.",
    "There's no place like 127.0.0.1",
    "To err is human, to blame it on someone else shows management potential.",
    "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
    "Why do programmers prefer dark mode? Because light attracts bugs.",
    "How many programmers does it take to change a light bulb? None, that's a hardware problem.",
    "Algorithm: A word used by programmers when they don't want to explain what they did.",
    "Keyboard not found. Press F1 to continue.",
    "I'm not antisocial, I'm just not user-friendly.",
    "Home is where the WiFi connects automatically.",
    "I void warranties.",
    "Artificial Intelligence is no match for natural stupidity.",
    "The cloud is just someone else's computer.",
    "I'm not a complete idiot, some parts are missing.",
    "Programmer's diet: Coffee, pizza, and existential dread.",
    "My code doesn't always work, but when it does, I have no idea why.",
    "Refactoring: Making the same mistakes with better style.",
    "Legacy code: Code written by someone who's no longer here to defend it.",
    "Rubber duck debugging: Because sometimes you need to explain your stupidity to an inanimate object.",
    "The best code is no code at all.",
    "I'm not procrastinating, I'm doing extensive research on the problem.",
    "Merge conflicts: Git's way of saying 'you two need to talk'.",
    "Production is just another name for 'testing in front of users'.",
    "I don't have a problem with caffeine. I have a problem without it.",
    "Code review: Where your ego goes to die.",
    "Documentation is like sex: when it's good, it's very good, and when it's bad, it's better than nothing.",
    "I'm not lazy, I'm just highly motivated to do nothing.",
    "The only thing more expensive than education is ignorance. And AWS bills.",
    "I'm not saying I'm Batman, but have you ever seen me and Batman in the same room?",
    "My code is like my jokes: nobody gets them.",
    "I'm not a hoarder, I'm just keeping all these browser tabs for research.",
    "Stackoverflow: Where copy-paste is a lifestyle.",
    "I'm not addicted to coding, I can stop anytime I want. Right after this feature.",
    "The best way to predict the future is to implement it. Badly.",
    "I'm not overthinking, I'm just considering all possible edge cases.",
    "My code is like a fine wine: it gets better with age. Just kidding, it's more like milk.",
    "I'm not stubborn, my code is just very opinionated.",
    "The only constant in programming is change. And bugs.",
    "I'm not lost, I'm just exploring alternative solutions.",
    "My code is poetry. Specifically, Vogon poetry.",
    "I'm not ignoring you, I'm just in the zone. The error zone.",
    "The best debugger is a good night's sleep. But coffee works too.",
    "I'm not antisocial, I just prefer async communication.",
    "My code is like a box of chocolates: you never know what you're gonna get. Probably an error.",
    "I'm not paranoid, I just write a lot of try-catch blocks.",
    "The only thing I test in production is my patience.",
    "I'm not a perfectionist, I just have very high standards for my bugs.",
    "My code is like a joke: if you have to explain it, it's probably bad.",
    "I'm not avoiding work, I'm just waiting for inspiration. And coffee.",
    "The best code comment is the one that explains why, not what. Or just 'lol idk'.",
    "I'm not disorganized, my code is just very organically structured.",
    "My code is like a garden: it needs constant maintenance or it becomes a jungle.",
    "I'm not slow, I'm just thorough. Very, very thorough.",
    "The only thing worse than no documentation is wrong documentation.",
    "I'm not arguing with the compiler, I'm just having a heated discussion.",
    "My code is like a puzzle: some pieces are missing and the picture doesn't match the box.",
    "I'm not giving up, I'm just pivoting to a different approach. For the 47th time.",
    "The best way to learn is by doing. And breaking. Lots of breaking.",
    "I'm not stressed, I'm just running at maximum capacity.",
    "My code is like a house of cards: one wrong move and everything collapses.",
    "I'm not obsessed with optimization, I just really hate slow code.",
    "The only thing better than working code is code that works and you understand why.",
    "I'm not a control freak, I just like my code to do exactly what I tell it.",
    "My code is like a teenager: it works, but I don't know how or why.",
    "I'm not avoiding the problem, I'm just taking a strategic break.",
    "The best code is the code you don't have to write. Or maintain. Or look at.",
    "I'm not being difficult, the requirements are just very flexible.",
    "My code is like a relationship: complicated, messy, and I'm not sure how I got here."
  ],
  "quotes": [
    "\"First, solve the problem. Then, write the code.\" - John Johnson",
    "\"Code is like humor. When you have to explain it, it's bad.\" - Cory House",
    "\"Any fool can write code that a computer can understand. Good programmers write code that humans can understand.\" - Martin Fowler",
    "\"Truth can only be found in one place: the code.\" - Robert C. Martin",
    "\"Simplicity is the soul of efficiency.\" - Austin Freeman",
    "\"Make it work, make it right, make it fast.\" - Kent Beck",
    "\"The best error message is the one that never shows up.\" - Thomas Fuchs",
    "\"Deleted code is debugged code.\" - Jeff Sickel",
    "\"Perfection is achieved not when there is nothing more to add, but rather when there is nothing more to take away.\" - Antoine de Saint-Exupery",
    "\"Walking on water and developing software from a specification are easy if both are frozen.\" - Edward V. Berard",
    "\"Programs must be written for people to read, and only incidentally for machines to execute.\" - Harold Abelson",
    "\"The most disastrous thing that you can ever learn is your first programming language.\" - Alan Kay",
    "\"Measuring programming progress by lines of code is like measuring aircraft building progress by weight.\" - Bill Gates",
    "\"Give someone a program, frustrate them for a day. Teach someone to program, frustrate them for a lifetime.\" - David Leinweber",
    "\"It's not a bug – it's an undocumented feature.\" - Anonymous",
    "\"Before software can be reusable it first has to be usable.\" - Ralph Johnson",
    "\"The best performance improvement is the transition from the nonworking state to the working state.\" - John Ousterhout",
    "\"Optimism is an occupational hazard of programming: feedback is the treatment.\" - Kent Beck",
    "\"When to use iterative development? You should use iterative development only on projects that you want to succeed.\" - Martin Fowler",
    "\"Simplicity is prerequisite for reliability.\" - Edsger W. Dijkstra"
  ]
}
